tests/performance/test.yaml
config:
  target: 'http://app:5000'
  phases:
    - duration: 30
      arrivalRate: 5

    - duration: 30
      arrivalRate: 10

    - duration: 30
      arrivalRate: 15

    - duration: 30
      arrivalRate: 20
      
scenarios:
  - name: "Basic health check"
    flow:
      - get:
          url: "/"